# 数据类型相关内置函数

'''
int() 函数：将其它类型数据转为整型
str() 函数：将其它类型数据转为字符串类型
float() 函数：将其它类型数据转为浮点类型
bool() 函数：将其它类型数据转为布尔类型
complex() 函数：将其它类型数据转为复数类型
list() 函数：将其它类型数据转为列表类型
tuple() 函数：将其它类型数据转为元组类型
dict() 函数：将其它类型数据转为字典类型
set()  函数：将其它类型数据转为集合类型
'''


# 变量相关函数
'''
id() 函数：获取当前数据的ID标识
type() 函数：获取当前数据的类型，返回字符串
print() 函数：数据的打印
input() 函数：获取输入的数据
isinstance() 函数： 检测是否为指定的数据类型
'''

# 数学相关函数
'''
abs() 函数:返回一个数的绝对值
sum() 函数：求和
max() 函数：获取最大值
min() 函数：获取最小值
pow() 函数：幂运算
round() 函数：
'''
# 获取一个数的绝对值
# print(abs(-99.99))

# 求和。从 start 开始自左向右对 iterable 的项求和并返回总计值。
# print(sum([1,2,3]))

# 获取最大值
# print(max([1,2,3]))
# print(max(99,20,38,45))

# 获取最小值
# print(min([2,1,5,-5]))
# print(min(6,7,1,0,-2))

# 幂运算：返回 x 的 y 次幂
# print(pow(2,3)) # 8

# 四舍五入
# r = round(3.1415926)
# r = round(3.1415926,2)  # 小数点保留几位
# r = round(1.5)  # 2  奇数进一位
# r = round(2.5)  # 2  偶数保持原样
# print(r)






























