# 面向对象 oop
'''
面向对象编程：
    Object Oriented Programming，简称oop，是一种以对象为中心的程序设计思想。
    是通过分析问题中需要的抽象模型，然后根据需要的功能分别去创建模型对象，最终由模型对象来完成程序。
面向过程编程：
    Procedure Oriented Programming，简称pop，是一种以过程为中心的程序设计思想。

问题：
    把大象装进冰箱，需要几步？
    第一步：大开冰箱门
    第二步：把大象装进去
    第三步：关上冰箱门
    面向过程：
        上面给出的答案就是面向过程，即遇到问题后，分析解决问题的步骤，然后一步步去实现
    面向对象：
        首先，面向对象要解决这个问题需要先建立出抽象模型。比如：打开冰箱门和关闭冰箱门，这都属于一个冰箱的功能。大象走进去，这就是大象的功能。
        此时，我们就出了两个抽象模型：一个是冰箱，一个是大象。冰箱具有打开、关闭的功能，大象具有走路的能力。
        分析到这里，就是面向对象的思想，具体完成的话，就是去创建冰箱和大象这两个对象，最终完成这个程序。
        冰箱对象-开门，大象对象-走进冰箱，冰箱对象-关门

问题：
    想吃清蒸鱼怎么办？
    面向过程分析：
        1.买鱼，买料
        2.杀鱼和清理，并且腌制
        3.放锅烧水
        4.把鱼放进去，开始蒸
        5.十分钟后开盖，把鱼端出来，浇汁
        面向过程中想完成这个愿望，需要一步一步的去执行。
    面向对象分析：
        需要一个对象：大厨
        告诉大厨，我想吃清蒸鱼
        面向对象就是调用对象去解决问题，具体的对象如何去解决呢？大厨这个对象肯定也是一步步完成的
        但是对于我来说，就是调用了对象，而对象去完成这个过程。
        当然，最终面向对象中有面向过程的体现。

如何去学习面向对象编程
    1.学习面向对象编程的思想
    2.学习面向对象编程的语法

面向过程和面向对象的区别和优缺点？
    一、面向过程：
        核心是过程，过程就是指解决问题的步骤。
        优点是：将复杂的问题流程化，进而实现简单化
        缺点是：扩展性差（更新、维护、迭代）
        总结： 在去完成一些简单的程序时，可以使用面向过程去解决
               但是如果有复杂的程序或任务，需要不断进行迭代和维护，就需要优先选择面向对象的编程思想
    二、面向对象：
        面向对象的核心是对象，是一个特征和功能的综合体。
        优点是：可扩展性高
        缺点是：编程复杂度相对面向过程高一些。指的是计算机在执行面向对象的程序时的性能表现。
    三、面向对象中的一些名称（术语）
    类：类是对象的一个抽象的概念
    对象（实例）：对象就是由类创建的实例
    类和对象的关系就是 模具和铸件的关系
        1.类是由对象总结而来的，总结的这个过程叫做抽象。
        2.对象是由类具体实施出来的，这个过程叫做实例化。
        3.水果是一个对象还是一个类？汽车是一个对象还是一个类？手机是一个对象还是一个类？
        4.现在给大家上课，用的是一个笔记本电脑，当前正在使用的笔记本电脑是一个对象还是一个类？
            笔记本电脑特征：金属外壳、优美的外观
            笔记本电脑功能：给大家讲课，编辑代码、听音乐
'''
























































