# 字符串格式化 format

## 1.普通方式
a = '李白'
# vars = '{}乘舟将欲行，忽闻岸上{}'.format(a,'踏歌声')

## 2.通过索引传参                             0    1   2
# vars = '{2}乘舟将欲行，忽闻岸上{1}'.format('a','b','c')   # c乘舟将欲行，忽闻岸上b

## 3.关键字传参
# vars = '{a}乘舟将欲行，忽闻岸上{b}'.format(a='李白',b='踏歌声')

## 4.容器类型数据传参
# vars = '豪放派：{0[0]}，婉约派：{0[1]}，蛋黄派：{0[2]}'.format(['李白','辛弃疾','达利园'])
data = {'a':'李白','b':'蛋黄派','c':'辛弃疾'}
vars = '{a}乘舟将欲行，忽闻岸上{b}'.format(**data)
# print(vars)

# 新增的格式化方法 f方法
vars = f'{data["a"]}乘舟将欲行,忽闻岸上{data["c"]}'
print(vars)

# # 限定小数的位数
# vars = '圆周率是多少：{:.4f}'.format(3.1415926)
# print(vars)

















































